{"name":{"firstName":"Derick","lastName":"","username":"Morieskie"},"email":"dcfynn@icloud.com","dob":"14/10/1958","address":"Cape Town, South Africa | Johannesburg, South Africa","mobileNumber":"+27 69 ___ 8725","imageSrc":"/assets/images/morieskie-274x.png","bio":"<p>As a seasoned full-stack software engineer and tech leader with 13 years of experience, I've had the privilege of working with diverse teams and clients across various environments, from startups and agencies to large-scale corporate settings. My expertise spans the entire software development lifecycle, from gathering requirements and creating technical designs to developing and delivering high-quality solutions.</p><h4>Key Strengths</h4> <ul> <li><b>Full-stack software development</b>: PHP, JavaScript, TypeScript, Node, MySQL, Laravel, Angular, and React</li> <li><b>DevOps practices</b>: CI/CD, containerization, and cloud computing</li> <li><b>Technical design and architecture</b></li> <li><b>Project management and team leadership</b></li> <li><b>Client relationship management and strategic business partnership</b></li> </ul><h4>Passion and Approach</h4> <p>I'm passionate about building innovative, user-friendly software solutions that drive business success. With a strong track record of delivering high-quality solutions, I'm committed to continuous learning and professional development. Currently, I'm expanding my skills in Ansible and Puppet to optimize production deployments.</p><h4>Career Aspirations</h4> <p>I'm excited to join a forward-thinking company where I can leverage my skills and experience to make a meaningful impact. With my strong technical expertise, leadership abilities, and passion for delivering exceptional results, I'm confident in my ability to become a valuable asset to your team. If you're looking for a dedicated, results-driven professional who is passionate about building innovative software solutions, let's connect!</p>","socialLinks":[{"firm":"Stack Overflow","icon":{"className":"fa fa-stack-overflow"},"url":"https://meta.stackoverflow.com/users/3572784/morieskie"},{"firm":"Github","icon":{"className":"fa fa-github"},"url":"https://github.com/morieskie"},{"firm":"Linkedin","icon":{"className":"fa fa-linkedin"},"url":"https://linkedin.com/in/dcfynn"},{"firm":"Google","icon":{"className":"fa fa-google"},"url":"#"}]}
